posts/2015-04-29-prayer-for-justice.org
#+date: <2015-04-29>
#+filetags: prayer religion
#+title: Prayer for Justice

A cry for justice swells up\\
from a people who have seen\\
so little of it.

"Yes, justice,"\\
comes the reply,\\
"But first,\\
we must have peace.\\
Peace today,\\
maybe justice tomorrow."

But a peace without justice,\\
is not the Shalom of God.\\
It is a peace that serves\\
the status quo,\\
the interests of the powerful,\\
and the coffers of the wealthy.

The prophets tell us that\\
your justice is measured\\
not by its effect\\
on the privileged,\\
but by its effect\\
on those who have\\
been denied\\
privilege and power.

The day is coming when\\
God's justice will reign,\\
when the low are lifted up\\
and the mighty fall,\\
and woe unto us\\
who have stood in the way\\
because of our silence.

/Amen/

