docs/posts/2015-04-29-prayer-for-justice.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Mar 29, 2025 13:16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for Justice</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link href='/pagefind/pagefind-ui.css' rel='stylesheet'>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for Justice</h1>
<p class="subtitle" role="doc-subtitle">Apr 29, 2015 00:00</p>
</header><p>
A cry for justice swells up<br>
from a people who have seen<br>
so little of it.
</p>

<p>
&ldquo;Yes, justice,&rdquo;<br>
comes the reply,<br>
&ldquo;But first,<br>
we must have peace.<br>
Peace today,<br>
maybe justice tomorrow.&rdquo;
</p>

<p>
But a peace without justice,<br>
is not the Shalom of God.<br>
It is a peace that serves<br>
the status quo,<br>
the interests of the powerful,<br>
and the coffers of the wealthy.
</p>

<p>
The prophets tell us that<br>
your justice is measured<br>
not by its effect<br>
on the privileged,<br>
but by its effect<br>
on those who have<br>
been denied<br>
privilege and power.
</p>

<p>
The day is coming when<br>
God&rsquo;s justice will reign,<br>
when the low are lifted up<br>
and the mighty fall,<br>
and woe unto us<br>
who have stood in the way<br>
because of our silence.
</p>

<p>
<i>Amen</i>
</p>



<div class="tagline" id="org65db0ed">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Mar 29, 2025 13:16.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
